{"is_small_upload": true, "recent_small_text": "--- Start of 6pages.pdf ---\nBajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 1 CUSTOMER INFORMATION SHEET This document provides key information about your policy. You are also advised to go through your policy document Sl No Title Description Policy Clause Number 1 Name of Insurance Product Health Infinity 2 Policy Number Kindly refer to Your Policy schedule 3 Type of Insurance Kindly refer to Your Policy schedule 4 Sum Insured (Basis) Kindly refer to Your Policy schedule 5 Policy Coverage (What the Policy Covers) Part I - Medical Expenses Section (Mandatory/Base Cover) In-patient Hospitalization Treatment - Medical Expenses incurred due to admission to a Hospital for Illness or Accidental Bodily Injury, longer than 24 consecutive hours. Section C.I.1 Pre-Hospitalization - up to 60 days prior to date of admission in hospital Section C.I.2 Post-Hospitalization - up to 90 days from date of discharge from the hospital Section C.I.3 Road Ambulance – max. up to ₹ . 5000/ - per hospitalization Section C.I.4 Day Care Procedures - Medical Expenses incurred due to admission to a Hospital for Illness or Accidental Bodily Injury, for duration less than 24 consecutive hours as listed on Annexure I in Policy wordings Section C.I. 5 Preventive Health Check Up - Free Preventive Health check -up after block of every 3 continuous renewal s of Health Infinity Policy with Us as per limits specified in policy wordings Section C.I .6 Modern Treatment Methods and Advancement in Technologies – Medical expenses incurred during admissible hospitalization, towards following procedures: a) Uterine Artery Embolization and HIFU b) Balloon Sinuplasty c) Deep Brain stimulation d) Oral chemotherapy e) Immunotherapy - Monoclonal Antibody to be given as injection f) Intra vitreal injections g) Robotic surgeries h) Stereotactic radio surgeries i) Bronchical Thermoplasty j) Vaporisation of the prostrate (Green laser treatment or holmium laser treatment) k) IONM -(Intra Operative Neuro Monitoring) l) Stem cell therapy: Hematopoietic stem cells for bone marrow transplant for hemato logical conditions to be covered 6 Exclusions (What the policy does not cover) Standard Exclusions applicable to all covers 1. Any hospital admission primarily for investigation diagnostic purpose (Excl04) 2. Expenses related to any admission primarily for enforced bed rest and not for receiving treatment. (Excl05) 3. Obesity/Weight Control (Excl06) 4. Change -of-gender treatments (Excl07) 5. Expenses for cosmetic or plastic surgery or any treatment to change appearance unless for reconstruction following an Accident, Burn(s) etc. (Excl08) Section D HEALTH INFINITY Bajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 2 6. Expenses related to any treatment necessitated due to participation as a professional in hazardous or ad venture sports (Excl 09) 7. Expenses for treatment arising from Insured committing or attempting to commit a breach of law with criminal intent. (Excl10) 8. Excluded Providers (Excl11) 9. Treatment for Alcoholism, drug or substance abuse. (Excl12) 10. Treatments receiv ed in heath hydros, nature cure clinics, etc. where admission is arranged wholly or partly for domestic reasons. (Excl 13) 11. Dietary supplements and substances unless prescribed as part of hospitalization claim or day care procedure. (Excl14) 12. Expenses relate d to the treatment for correction of eye sight due to refractive error less than 7.5 dioptres. (Excl15) 13. Expenses related to any unproven treatment, services and supplies. (Excl16) 14. Expenses related to sterility and infertility. (Excl17) 15. Medical Treatme nt Expenses traceable to pregnancy and its complications. (Excl 18) (applicable to Silver plan only General exclusions 1. Cosmetic dental procedures unless due to Accidental Injury. 2. Medical expenses where Inpatient care and medical supervision is not required 3. War, invasion, acts of foreign enemies 4. Any Medical expenses incurred due to Act of Terrorism will be covered under the Policy 5. Circumcision unless required for the treatment of Illness or Accidental bodily injury, 6. The cost of external durable medical equipment except Cost of Artificial Limbs, cost of prosthetic devices implanted during surgical procedure like Pacemaker, orthopedic implants, etc.etc. 7. External medical equipment of any kind used at home as post Hospitalization 8. Congenital external diseases or defects or anomalies, growth hormone therapy, stem cell implantation or surgery except for Hematopoietic stem cells for bone marrow transplant for hematological conditions. 9. Intentional self -injury 10. Vaccination or inoculation 11. Treatment for any other system other than modern medicine (also known as Allopathy) and AYUSH therapies 12. All non -medical Items as per Annexure II in policy wordings 13. Any treatment received outside India 7 Waiting Period • Time period during which specified disease/treat ment are not covered • It is counted from beginning of the policy coverage Initial Waiting period: 30days for all illnesses (Not applicable in case of continuous renewal or accidents) Specific Waiting period : Applicable to Part I Medical Expenses Section (Mandatory/Base Cover) 24 Months Waiting period: 1. Any type gastrointestinal ulcers 2. Cataracts, 3. Any type of fistula 4. Macular Degeneration 5. Benign prostatic hypertrophy 6. Hernia of all types 7. All types of sinuses 8. Fissure in ano 9. Haemorrhoids, piles 10. Hydrocele 11. Dysfunctional uterine bleeding Section D- I. Bajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 3 12. Fibromyoma 13. Endometriosis 14. Hysterectomy 15. Uterine Prolapse 16. Stones in the urinary and biliary systems 17. Surgery on ears/tonsils/ adenoids/ paranasal sinuses 18. Surgery on all internal or external tumours/ cysts/nodules/ polyps of any kind including breast lumps with exception of Malignant tumor or growth 19. Parkinson’s Disease 20. Alzheimer’s Disease 36 months waiting period 1. Joint replacement surgery 2. Surgery for vertebral column disorders (unless necessitated due to an accident) 3. Surgery to correct deviated nasal septum 4. Hypertrophied turbinate 5. Congenital internal diseases or anomalies 6. Treatment for correction of eye sight due to refractive error recommended by Opht halmologist for medical reasons with refractive error greater or equal to 7.5 Pre-existing diseases: 36 months 8 Financial Limits of Coverage i.Sublimit (it is a pre defined limt and the insurance company will not pay any amount in excess of this limit) ii.Co-payment (it is a specified amount /percentage of the admissible claim amount to be paid by policy holder/insure d) iii.Deductible (it is a specified amount: Upto which an insurance company will not pay any claim and The policy will pay only up to the limits specified hereunder for the following diseases/procedures: Sub limits - Not applicable Co-payment - Not applicable Deductible – Not applicable Other Limits – 1. All Hospitalization expenses during the Policy period as per the Policy coverage, terms conditions, definitions & exclusions are covered upto 100 times the room rent limit. However if the claim approved amount exceeds 100 times the room rent limit opted ( in a single claim or multiple claims) then a co -payment of 15%/20%/25% as opted would apply on the claim amount. The co -payment would apply on the claim amount exceeding 100 times of the room rent limit and not on the Complete claim. 2. The Maximum limit of indemnity for Listed Modern Treatments , specified in Annexure III, would be 100 times of the room rent limit. Claim amount exceeding 100 times of the room rent limit would be not be admissible under the policy Section E. 22 Bajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 4 Which will be deducted from total claim amount (if claim amount is more than the specified amount) iv.Any other limit (as applicable) 9 Claims/claim s procedure Cashless Claim process (applicable only for Hospitalization Expenses Section ) Cashless treatment is only available at Network Hospitals • You or Your representative must intimate Us 48 hours before the planned Hospitalization and within 24 hours of emergency hospitalization and request pre -authorization by way of the written form • We will review each claim for Medical Expenses, coverage and accordingly issue an authorization letter either to You or the Network Hospital. Reimbursement claim process (Applicable for all sections ) • Applicable for claims where treatment is taken at a Non network hospital OR If we have denied your claim as per Cashless Claims Procedure. • You or Your representative must intimate Us 48 hours befor e the planned Hospitalization and within 48 hours of emergency hospitalization • You or someone claiming on Your behalf must promptly and in any event within 30 days of discharge from a Hospital give Us the documentation • In the event of the death of the in sured person, someone claiming on his behalf must inform Us in writing immediately and send Us a copy of the post mortem report (if any) within 30 days. • The Company shall settle or reject the claim within 45days from the date of receipt of last necessary d ocument. Turnaround time(TAT) for claim settlement (Applicable only for Hospitalization Expenses Section ) 1. Turnaround time (TAT) for claim settlement: 30 Working Days 2. TAT for preauthorization of cashless facility: Within 120 Mins TAT for cashless final bill authorization: Within 120 Mins Weblinks Network hospital and Black listed hospital list https://www.bajajallianz.com/branch -locator.htmll Helpline numbers Tollfree: 1800 -103-2529 Downloading /getting claim forms Health Insurance Claim Process | Accident Insurance Claim (bajajallianz.com) Section E 33. A & B 10 Policy Servicing Call centre number(Toll free): 1800 -209-5858 Details of Company officials: Branch -wise GRO details can be found on the below link. Bajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 5 https://www.bajajallianz.com/download -documents/other -information/GRO - List.pdf 11 Grievances /Complaints Grievance Redressal Procedure: a) Toll-free number 1 -800-209- 5858 or 020 -30305858, Say “Hi” on WhatsApp on +91 7507245858 b) Branches for resolution of your grievances /complaints, the Branch details can be found on our website: www.bajajallianz.com/branch - locator.html Register your grievances / complaints on our website : www.bajajallianz.com/about -us/customer -service.html c) E-mail • Level 1: bagichelp@bajajallianz.co.in and for senior citizens to seniorcitizen@bajajallianz.co.in • Level 2: In case you are not satisfied with the response given to you at Level 1 you may write to our Grievance Redressal Officer at ggro@bajajallianz. co.in • Level 3: If in case, your grievance is still not resolved, and you wish to talk to our care specialist, please give a missed call on +91 8080945060 OR SMS To 575758 and our care specialist will call you back d) If you are still not satisfied with the de cision of the Insurance Company, you may approach the Insurance Ombudsman, established by the Central Government for redressal of grievance. Detailed process along with list of Ombudsman offices are available at www.cioins.co.in/ombudsman.html Section E.17 12 Things to remember Free Look Cancellation: Insured has an option of cancelling his/her policy up to 30 days from the first inception of policy with Us , subject to rest terms and conditions. Policy Renewal: Except on grounds of fraud , moral hazard or mis representation or non -co-operation , renewal of your policy shall not be denied Migration and Portability: At renewal Insured has an option to migrate his /her policy to other policy with us or port the policy to another insurer subject to terms a nd conditions specified under Migration and Portability guidelines For detailed guidelines on Migration and Portability , kindly refer the link https://irdai.gov.in/document -detail?documentId=393128 beneficiary will have the option to port the policy to other insurers by applying to such insurer to port the entire policy along with all the members of the family, if any ,at least45days before, butn otearlierthan60days from the policy renewal date as per IRDAI guidelines related to portability. If such person is presently covered and has been continuously covered without any lapses under any health insurance policy with an Indian General/Health insure r, the proposed Insured beneficiary will get the accrued continuity benefits in waiting periods as per IRDAI guidelines on portability Change in Sum Insured: sum insured can be changed (increased/decreased) only at the time of renewal subject to underwrit ing by the company. For increase in Sum insured , the waiting periods if any shall start afresh only for the enhance portion of the sum insured Moratorium period: After the expiry of Moratorium Period no health insurance policy shall be contestable except for proven fraud and permanent exclusions specified in the policy contract The moratorium would be applicable for the sum insured of the first policy and subsequ ently completion of 60 continuous months would be applicable from date of enhancement of sums insured only on the enhanced limits Section E Bajaj Allianz General Insurance Co. Ltd. Bajaj Allianz House, Airport Road, Yerawada, Pune - 411 006. Reg. No.: 113 For more details, log on to: www.bajajallianz.com | E-mail: bagichelp@bajajallianz.co.in or Call at: Sales - 1800 209 0144 / Service - 1800 209 5858 (Toll Free No.) Issuing Office: CIN U66010PN2000PLC015329, UIN: BAJHLIP21005V022021 6 Declaration by policy holder I have read the above and confirm having noted the details Place Date: Signature of Poli cy holder Note: Web link for downloading the product related documents https://www.bajajallianz.com/health -insurance -plans/health -insurance -documents.html 13 Your Obligations Please disclose all pre -existing disease/s or condition/s before buying a policy. Non-disclosure may affect the claim settlement Disclosure of other material information during the policy period. Legal Disclaimer Note: The information must be read in conjunction with the product brochure and policy document. In case of any conflict between the CIS and the policy document, the terms and conditions mentioned in the policy document shall prevail.\n--- End of 6pages.pdf ---\n\n"}